const sentences = {
    sentence: {
        'en': {
            'welcome': ['Your ride, on Demand', 'Load your truck and transport to market with AgriSmart. It connects you with a reliable ride in minutes. One tap and a truck comes directly to you.', 'Register'],
            'login': ['Get Moving with AgriSmart', 'Enter your Mobile number'],
            'OTP': ['Enter 4 digit code sent to you', 'did you enter the correct number?', 'I didn\'t recieve the code'],
            'name': ['Enter your Name'],
            'mode': ['I\'m a Farmer', 'I\'m a Transporter'],
            'profilePic': ['Upload Profile Picture'],
        },
        'hi': {
            'welcome': ['आपकी सवारी, डिमांड पर', 'अपने ट्रक और परिवहन को एग्रीस्मार्ट के साथ बाजार में लोड करें। यह आपको मिनटों में एक विश्वसनीय सवारी से जोड़ता है। एक क्लिक और एक ट्रक सीधे आपके पास आता है।', 'रजिस्टर करें'],
            'login': ['एग्रीस्मार्ट के साथ आगे बढ़ें', 'अपना मोबाइल नंबर दर्ज करें'],
            'OTP': ['आपको भेजा गया 4 अंकों का कोड दर्ज करें', 'क्या आपने सही मोबाइल नंबर दर्ज किया है?', 'मैंने कोड प्राप्त नहीं किया'],
            'name': ['अपना नाम दर्ज करें'],
            'mode': ['मैं एक किसान हूँ', 'मैं एक ट्रांसपोर्टर हूं'],
            'profilePic': ['प्रोफ़ाइल चित्र अपलोड करें'],
        },
        'mr': {
            'welcome': ['मागणीनुसार आपली राइड', 'आपला ट्रक लोड करा आणि अ‍ॅग्रीस्मार्टसह बाजारपेठेत वाहतूक करा. हे आपल्याला मिनिटांत विश्वासार्हतेने जोडते. एक क्लिक आणि एक ट्रक थेट आपल्याकडे येतो.', 'नोंदणी करा'],
            'login': ['अ‍ॅग्रीस्मार्टसह फिरणे मिळवा', 'तुमचा भ्रमणध्वनी क्रमांक टाका'],
            'OTP': ['आपल्याला पाठविलेले 4 अंकी कोड प्रविष्ट करा', 'आपण अचूक क्रमांक प्रविष्ट केला आहे?', 'मला कोड प्राप्त झाला नाही'],
            'name': ['आपले नांव लिहा'],
            'mode': ['मी एक शेतकरी आहे', 'मी ट्रान्सपोर्टर आहे'],
            'profilePic': ['प्रोफाइल चित्र अपलोड करा'],
        },
        'kn': {
            'welcome': ['ನಿಮ್ಮ ಸವಾರಿ, ಬೇಡಿಕೆಯ ಮೇರೆಗೆ', 'ನಿಮ್ಮ ಟ್ರಕ್ ಅನ್ನು ಲೋಡ್ ಮಾಡಿ ಮತ್ತು ಅಗ್ರಿಸ್ಮಾರ್ಟ್ನೊಂದಿಗೆ ಮಾರುಕಟ್ಟೆಗೆ ಸಾಗಿಸಿ. ಇದು ನಿಮಿಷಗಳಲ್ಲಿ ವಿಶ್ವಾಸಾರ್ಹ ಸವಾರಿಯೊಂದಿಗೆ ನಿಮ್ಮನ್ನು ಸಂಪರ್ಕಿಸುತ್ತದೆ. ಒಂದು ಕ್ಲಿಕ್ ಮತ್ತು ಟ್ರಕ್ ನಿಮಗೆ ನೇರವಾಗಿ ಬರುತ್ತದೆ.', 'ನೋಂದಣಿ'],
            'login': ['ಅಗ್ರಿಸ್ಮಾರ್ಟ್ನೊಂದಿಗೆ ಚಲಿಸುವಿಕೆಯನ್ನು ಪಡೆಯಿರಿ', 'ನಿಮ್ಮ ಮೊಬೈಲ್ ನಂಬರನ್ನು ನಮೂದಿಸಿರಿ'],
            'OTP': ['ನಿಮಗೆ ಕಳುಹಿಸಲಾದ 4 ಅಂಕಿಯ ಕೋಡ್ ಅನ್ನು ನಮೂದಿಸಿ', 'ನೀವು ಸರಿಯಾದ ಸಂಖ್ಯೆಯನ್ನು ನಮೂದಿಸಿದ್ದೀರಾ?', 'ನಾನು ಕೋಡ್ ಸ್ವೀಕರಿಸಲಿಲ್ಲ'],
            'name': ['ನಿಮ್ಮ ಹೆಸರನ್ನು ನಮೂದಿಸಿ'],
            'mode': ['ನಾನು ಕೃಷಿಕ', 'ನಾನು ಟ್ರಾನ್ಸ್‌ಪೋರ್ಟರ್'],
            'profilePic': ['ಪ್ರೊಫೈಲ್ ಚಿತ್ರವನ್ನು ಅಪ್‌ಲೋಡ್ ಮಾಡಿ'],
        },
        'ta': {
            'welcome': ['உங்கள் சவாரி, தேவைக்கேற்ப', 'உங்கள் டிரக்கை ஏற்றி, அக்ரிஸ்மார்ட் மூலம் சந்தைக்கு கொண்டு செல்லுங்கள். இது நிமிடங்களில் நம்பகமான சவாரி மூலம் உங்களை இணைக்கிறது. ஒரு கிளிக் மற்றும் ஒரு டிரக் உங்களுக்கு நேரடியாக வரும்.', 'பதிவு'],
            'login': ['அக்ரிஸ்மார்ட்டுடன் நகரவும்', 'உங்களுடைய கைபேசி எண்ணை உள்ளிடவும்'],
            'OTP': ['உங்களுக்கு அனுப்பப்பட்ட 4 இலக்க குறியீட்டை உள்ளிடவும்', 'நீங்கள் சரியான எண்ணை உள்ளிட்டுள்ளீர்களா?', 'நான் குறியீட்டைப் பெறவில்லை'],
            'name': ['உங்கள் பெயரை உள்ளிடவும்'],
            'mode': ['நான் ஒரு விவசாயி', 'நான் ஒரு டிரான்ஸ்போர்ட்டர்'],
            'profilePic': ['சுயவிவரப் படத்தைப் பதிவேற்றுக'],
        },
        'te': {
            'welcome': ['మీ రైడ్, డిమాండ్ మీద', 'మీ ట్రక్కును లోడ్ చేసి, అగ్రిస్‌మార్ట్‌తో మార్కెట్‌కు రవాణా చేయండి. ఇది నిమిషాల్లో నమ్మకమైన ప్రయాణంతో మిమ్మల్ని కలుపుతుంది. ఒక క్లిక్ మరియు ట్రక్ మీకు నేరుగా వస్తుంది.', 'నమోదు'],
            'login': ['అగ్రిస్‌మార్ట్‌తో కదలండి', 'మీ మొబైల్ నెంబర్ ను ఎంటర్ చేయండి'],
            'OTP': ['మీకు పంపిన 4 అంకెల కోడ్‌ను నమోదు చేయండి', 'మీరు సరైన సంఖ్యను నమోదు చేశారా?', 'నేను కోడ్‌ను స్వీకరించలేదు'],
            'name': ['మీ పేరు రాయుము, మీ పేరు రాయండి'],
            'mode': ['నేను రైతును', 'నేను ట్రాన్స్పోర్టర్'],
            'profilePic': ['ప్రొఫైల్ చిత్రాన్ని అప్‌లోడ్ చేయండి'],
        },
        'gu': {
            'welcome': ['તમારી સવારી, માંગ પર', 'તમારા ટ્રકને લોડ કરો અને એગ્રીસ્માર્ટથી બજારમાં પરિવહન કરો. તે તમને મિનિટમાં વિશ્વસનીય સવારી સાથે જોડે છે. એક ક્લિક અને એક ટ્રક સીધા તમારી પાસે આવે છે.', 'નોંધણી કરો'],
            'login': ['એગ્રીસ્માર્ટ સાથે આગળ વધો', 'તમારો મોબાઇલ નંબર દાખલ કરો'],
            'OTP': ['તમને મોકલેલો 4 અંકનો કોડ દાખલ કરો', 'તમે સાચો નંબર દાખલ કર્યો છે?', 'મેં કોડ પ્રાપ્ત કર્યો નથી'],
            'name': ['તમારું નામ દાખલ કરો'],
            'mode': ['હું ખેડૂત છું', 'હું ટ્રાન્સપોર્ટર છું'],
            'profilePic': ['પ્રોફાઇલ ચિત્ર અપલોડ કરો'],
        },
        'pa': {
            'welcome': ['ਤੁਹਾਡੀ ਸਵਾਰੀ, ਡਿਮਾਂਡ ਤੇ', 'ਆਪਣੇ ਟਰੱਕ ਨੂੰ ਲੋਡ ਕਰੋ ਅਤੇ ਐਗਰਿਸਮਾਰਟ ਨਾਲ ਮਾਰਕੀਟ ਵਿੱਚ ਆਵਾਜਾਈ. ਇਹ ਤੁਹਾਨੂੰ ਮਿੰਟਾਂ ਵਿਚ ਇਕ ਭਰੋਸੇਯੋਗ ਰਾਈਡ ਨਾਲ ਜੋੜਦਾ ਹੈ. ਇਕ ਕਲਿੱਕ ਅਤੇ ਇਕ ਟਰੱਕ ਸਿੱਧਾ ਤੁਹਾਡੇ ਕੋਲ ਆ ਜਾਂਦਾ ਹੈ.', 'ਰਜਿਸਟਰ'],
            'login': ['ਐਗਰੀਸਮਾਰਟ ਨਾਲ ਚੱਲੋ', 'ਆਪਣਾ ਮੋਬਾਈਲ ਨੰਬਰ ਦਰਜ ਕਰੋ'],
            'OTP': ['ਤੁਹਾਨੂੰ ਭੇਜਿਆ ਗਿਆ 4 ਅੰਕ ਦਾ ਕੋਡ ਦਰਜ ਕਰੋ', 'ਕੀ ਤੁਸੀਂ ਸਹੀ ਨੰਬਰ ਦਰਜ ਕੀਤਾ ਹੈ', 'ਮੈਂ ਕੋਡ ਪ੍ਰਾਪਤ ਨਹੀਂ ਕੀਤਾ'],
            'name': ['ਆਪਣਾ ਨਾਮ ਦਰਜ ਕਰੋ'],
            'mode': ['ਮੈਂ ਇੱਕ ਕਿਸਾਨ ਹਾਂ', 'ਮੈਂ ਟਰਾਂਸਪੋਰਟਰ ਹਾਂ'],
            'profilePic': ['ਪ੍ਰੋਫਾਈਲ ਤਸਵੀਰ ਅਪਲੋਡ ਕਰੋ'],
        },
    }
};

export default sentences;
